#### 📖 Terraform Plan ('infra-io/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
module.cgn_func_asp_01_autoscaler.module.function_app_autoscaler.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_count_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_count_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/v1/cgn/operator-search/count, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | AppIO] Failures in responding to App IO"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where originalHost_s in (datatable (name: string) ["app-backend.io.italia.it", "api-app.io.pagopa.it"])
                | where requestUri_s matches regex "/api/v1/cgn/operator-search/count"
                | where httpStatus_d >= 500
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_discount_bucket_code_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_discount_bucket_code_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/v1/cgn/operator-search/discount-bucket-code/{discount_id}, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | AppIO] Failures in responding to App IO"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where originalHost_s in (datatable (name: string) ["app-backend.io.italia.it", "api-app.io.pagopa.it"])
                | where requestUri_s matches regex "/api/v1/cgn/operator-search/discount-bucket-code/[^/]+"
                | where httpStatus_d >= 500
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_merchant_profile_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_merchant_profile_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/v1/cgn/operator-search/merchants/{merchant_id}, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | AppIO] Failures in responding to App IO"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where originalHost_s in (datatable (name: string) ["app-backend.io.italia.it", "api-app.io.pagopa.it"])
                | where requestUri_s matches regex "/api/v1/cgn/operator-search/merchants/[^/]+"
                | where httpStatus_d >= 500
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_offline_merchants_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_offline_merchants_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/v1/cgn/operator-search/offline-merchants, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | AppIO] Failures in responding to App IO"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where originalHost_s in (datatable (name: string) ["app-backend.io.italia.it", "api-app.io.pagopa.it"])
                | where requestUri_s matches regex "/api/v1/cgn/operator-search/offline-merchants"
                | where httpStatus_d >= 500
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_online_merchants_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_online_merchants_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/v1/cgn/operator-search/online-merchants, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | AppIO] Failures in responding to App IO"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where originalHost_s in (datatable (name: string) ["app-backend.io.italia.it", "api-app.io.pagopa.it"])
                | where requestUri_s matches regex "/api/v1/cgn/operator-search/online-merchants"
                | where httpStatus_d >= 500
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_published_product_categories_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_published_product_categories_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/v1/cgn/operator-search/published-product-categories, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | AppIO] Failures in responding to App IO"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where originalHost_s in (datatable (name: string) ["app-backend.io.italia.it", "api-app.io.pagopa.it"])
                | where requestUri_s matches regex "/api/v1/cgn/operator-search/published-product-categories"
                | where httpStatus_d >= 500
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"
        }
    }

  # azurerm_monitor_scheduled_query_rules_alert_v2.cgn_search_func_search_failure will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert_v2" "cgn_search_func_search_failure" {
      + auto_mitigation_enabled                = false
      + created_with_api_version               = (known after apply)
      + description                            = "There have been some failures on /api/v1/cgn/operator-search/search, citizens are being impacted."
      + enabled                                = true
      + evaluation_frequency                   = "PT5M"
      + id                                     = (known after apply)
      + is_a_legacy_log_analytics_rule         = (known after apply)
      + is_workspace_alerts_storage_configured = (known after apply)
      + location                               = "italynorth"
      + name                                   = "[CGN | AppIO] Failures in responding to App IO"
      + resource_group_name                    = "io-p-itn-cgn-rg-01"
      + scopes                                 = [
          + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-external/providers/Microsoft.Network/applicationGateways/io-p-appgateway",
        ]
      + severity                               = 1
      + tags                                   = {
          + "BusinessUnit"   = "CGN"
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO CGN"
          + "Owner"          = "IO"
          + "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      + window_duration                        = "PT15M"
      + workspace_alerts_storage_enabled       = false

      + action {
          + action_groups = [
              + "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-cgn-error-ag-01",
            ]
        }

      + criteria {
          + operator                = "GreaterThan"
          + query                   = <<-EOT
                AzureDiagnostics
                | where originalHost_s in (datatable (name: string) ["app-backend.io.italia.it", "api-app.io.pagopa.it"])
                | where requestUri_s matches regex "/api/v1/cgn/operator-search/search"
                | where httpStatus_d >= 500
            EOT
          + threshold               = 10
          + time_aggregation_method = "Count"
        }
    }

  # module.cgn_func_asp_01_autoscaler.module.function_app_autoscaler.azurerm_monitor_autoscale_setting.this must be replaced
-/+ resource "azurerm_monitor_autoscale_setting" "this" {
      ~ id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Insights/autoScaleSettings/io-p-itn-cgn-func-as-01" -> (known after apply)
        name                = "io-p-itn-cgn-func-as-01"
        tags                = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
      ~ target_resource_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-cgn-func-asp-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-cgn-func-asp-01" # forces replacement
        # (3 unchanged attributes hidden)

      ~ profile {
            name = "Default"

          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-cgn-func-asp-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-cgn-func-asp-01"
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }
          ~ rule {
              ~ metric_trigger {
                  ~ metric_resource_id       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/serverfarms/io-p-itn-cgn-func-asp-01" -> "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/serverFarms/io-p-itn-cgn-func-asp-01"
                    # (9 unchanged attributes hidden)
                }

                # (1 unchanged block hidden)
            }

            # (3 unchanged blocks hidden)
        }
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-card-func-02"
        name                                           = "io-p-itn-cgn-card-func-02"
        tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_card_02.module.function_app_cgn_card.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-card-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-merchant-func-02"
        name                                           = "io-p-itn-cgn-merchant-func-02"
        tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_merchant_02.module.function_app_cgn_merchant.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-merchant-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-search-func-02"
        name                                           = "io-p-itn-cgn-search-func-02"
        tags                                           = {
            "BusinessUnit"                                   = "CGN"
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO CGN"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions_cgn_search_02.module.function_app_cgn_search.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = (sensitive value)
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-cgn-rg-01/providers/Microsoft.Web/sites/io-p-itn-cgn-search-func-02/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "CGN"
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO CGN"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-cgn/blob/main/infra/resources/prod"
        }
        # (29 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 8 to add, 6 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.redis_cgn.azurerm_redis_cache.this,
  on .terraform/modules/redis_cgn/redis_cache/main.tf line 7, in resource "azurerm_redis_cache" "this":
   7:   enable_non_ssl_port           = var.enable_non_ssl_port

`enable_non_ssl_port` will be removed in favour of the property
`non_ssl_port_enabled` in version 4.0 of the AzureRM Provider.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
